/** 
 *
concat(); // обьединение строк
valueOF(); //преобразует object в строковое представление (завязан на  to String())
join(); //обьеденяет набор строк в одну с учетом разделителя
charAt(); //получение символа по индексу
indexOf(); //первый индекс вхождения подстроки
lastindexOf(); //последний индекс вхождения подстроки
startsWith()/endsWith(); // определяет начинается/заканчивается ли строка с подстроки
replase(); // замена одной подстроки на другую

trim(); // удаляет начальные и онечные пробелы
substring() ; //возвращает подстроку, см.аргументы
toLowerCase()/toUpperCase(); //возвращает новую строку в нижнем.верхнем регистре
compareTo(); //сравнивает две строки
equals(); // стравнивает строки с учетом регистра
equalsignoreCase() ; //сравнивает строки без учета регистра
regionMachhes(); //сравнивает подстроки в строках

*/

